Repository: openwall/Owl
Catalog: packages/findutils/findutils-*.po
Languages: ru

source: invalid argument %s for %s
ru: неверный аргумент %s у %s

source: ambiguous argument %s for %s
ru: неоднозначный аргумент %s у %s

source: Valid arguments are:
ru: Допустимые аргументы:

source: Unknown system error
ru: Неизвестная системная ошибка

source: %s: option `%s' is ambiguous
ru: %s: ключ `%s' неоднозначен

source: %s: option `--%s' doesn't allow an argument
ru: %s: ключ `--%s' используется без аргумента

source: %s: option `%c%s' doesn't allow an argument
ru: %s: ключ `%c%s' используется без аргумента

source: %s: option `%s' requires an argument
ru: %s: ключ `%s' требует аргумент

source: %s: unrecognized option `--%s'
ru: %s: неизвестный ключ `--%s'

source: %s: unrecognized option `%c%s'
ru: %s: неизвестный ключ `%c%s'

source: %s: illegal option -- %c
ru: %s: недопустимый ключ -- %c

source: %s: invalid option -- %c
ru: %s: неверный ключ -- %c

source: %s: option requires an argument -- %c
ru: %s: ключ требует аргумент -- %c

source: %s: option `-W %s' is ambiguous
ru: %s: ключ `-W %s' неоднозначен

source: %s: option `-W %s' doesn't allow an argument
ru: %s: ключ `-W %s' используется без аргумента

source: Invalid regular expression
ru: Неверное регулярное выражение

source: invalid %s%s argument `%s'
ru: неверный %s%s аргумент `%s'

source: invalid suffix in %s%s argument `%s'
ru: неверный суффикс у %s%s аргумента `%s'

source: %s%s argument `%s' too large
ru: %s%s аргумент `%s' слишком велик

source: cannot get current directory
ru: не могу получить текущий каталог

source: cannot stat current directory
ru: не могу получить состояние текущего каталога

source: Warning: file system %s has recently been unmounted.
ru: Предупреждение: файловая система %s была недавно размонтирована.

source: Warning: file system %s has recently been mounted.
ru: Предупреждение: файловая система %s была недавно cмонтирована.

source: %s%s changed during execution of %s (old device number %ld, new device number %ld, file system type is %s) [ref %ld]
ru: %s%s изменился во время выполнения %s (прежний номер устройства %ld, новый номер устройства %ld, тип файловой системы %s) [строка %ld]

source: %s%s changed during execution of %s (old inode number %<PRIuMAX>, new inode number %<PRIuMAX>, file system type is %s) [ref %ld]
ru: %s%s изменился во время выполнения %s (прежний номер inode %<PRIuMAX>, новый номер inode %<PRIuMAX>, тип файловой системы %s) [строка %ld]

source: Symbolic link %s is part of a loop in the directory hierarchy; we have already visited the directory to which it points.
ru: Символическая ссылка %s является элеменом цикла в файловой структуре; тот каталог, на который эта ссылка указывает, уже был обработан.

source: warning: not following the symbolic link %s
ru: предупреждение: не следую по символьной ссылке %s

source: WARNING: Hard link count is wrong for %s (saw only st_nlink=%d but we already saw %d subdirectories): this may be a bug in your file system driver. Automatically turning on find's -noleaf option. Earlier results may have failed to include directories that should have been searched.
ru: Предупреждение: неправильное значение счётчика ссылок у %s (значение st_nlink=%d не совпадает с найдеными %d подкаталогами): вероятно, вследствие ошибки драйвера файловой системы. Автоматически включён режим -noleaf работы find. Возможно, что некоторые каталоги не были обработаны.

source: unknown
ru: неизвестный

source: File system loop detected; %s is part of the same file system loop as %s.
ru: Обнаружен цикл в файловой системе; %s является частью того же самого цикла, что и %s.

source: Warning: file %s appears to have mode 0000
ru: Предупреждение: у файла %s права доступа 0000

source: cannot search %s
ru: невозможно найти %s

source: warning: you have specified the %s option after a non-option argument %s, but options are not positional (%s affects tests specified before it as well as those specified after it). Please specify options before other arguments.
ru: предупреждение: параметр %s указан после выражения %s, однако параметры не являются перемещаемыми (%s влияет на выражения, указанные как до, так и после этого параметра). Рекомендуется указывать параметры до прочих аргументов.

source: warning: the -d option is deprecated; please use -depth instead, because the latter is a POSIX-compliant feature.
ru: предупреждение: ключ -d упразднён; вместо него рекомендуется использовать -depth, соответствующий стандарту POSIX.

source: default path is the current directory; default expression is -print expression may consist of: operators, options, tests, and actions:
ru: путь по умолчанию: текущий подкаталог; выражение по умолчанию: -print выражения могут состоять из операторов, ключей, проверок и действий:

source: operators (decreasing precedence; -and is implicit where no others are given): ( EXPR ) ! EXPR -not EXPR EXPR1 -a EXPR2 EXPR1 -and EXPR2 EXPR1 -o EXPR2 EXPR1 -or EXPR2 EXPR1 , EXPR2
ru: операторов (в нисходящем порядке; -and берется по умолчанию, если не дано других): ( EXPR ) ! EXPR -not EXPR EXPR1 -a EXPR2 EXPR1 -and EXPR2 EXPR1 -o EXPR2 EXPR1 -or EXPR2 EXPR1 , EXPR2

source: positional options (always true): -daystart -follow -regextype normal options (always true, specified before other expressions): -depth --help -maxdepth LEVELS -mindepth LEVELS -mount -noleaf --version -xdev -ignore_readdir_race -noignore_readdir_race
ru: позиционных ключей (всегда true): -daystart -follow -regextype обычных ключей (всегда true, указываются перед выражениями других типов): -depth --help -maxdepth LEVELS -mindepth LEVELS -mount -noleaf --version -xdev -ignore_readdir_race -noignore_readdir_race

source: tests (N can be +N or -N or N): -amin N -anewer FILE -atime N -cmin N -cnewer FILE -ctime N -empty -false -fstype TYPE -gid N -group NAME -ilname PATTERN -iname PATTERN -inum N -iwholename PATTERN -iregex PATTERN -links N -lname PATTERN -mmin N -mtime N -name PATTERN -newer FILE
ru: проверок (N может быть +N или -N или N): -amin N -anewer FILE -atime N -cmin N -cnewer FILE -ctime N -empty -false -fstype TYPE -gid N -group NAME -ilname PATTERN -iname PATTERN -inum N -iwholename PATTERN -iregex PATTERN -links N -lname PATTERN -mmin N -mtime N -name PATTERN -newer FILE

source: actions: -delete -print0 -printf FORMAT -fprintf FILE FORMAT -print -fprint0 FILE -fprint FILE -ls -fls FILE -prune -quit -exec COMMAND ; -exec COMMAND {} + -ok COMMAND ; -execdir COMMAND ; -execdir COMMAND {} + -okdir COMMAND ;
ru: действий: -delete -print0 -printf FORMAT -fprintf FILE FORMAT -print -fprint0 FILE -fprint FILE -ls -fls FILE -prune -quit -exec COMMAND ; -exec COMMAND {} + -ok COMMAND ; -execdir COMMAND ; -execdir COMMAND {} + -okdir COMMAND ;

source: Report (and track progress on fixing) bugs via the findutils bug-reporting page at http://savannah.gnu.org/ or, if you have no web access, by sending email to <bug-findutils@gnu.org>.
ru: Сообщайте об ошибках в программе find (и отслеживайте исправление этих ошибок) через веб-страницу пакета findutils на http://savannah.gnu.org/ или посредством электронной почты по адресу списка рассылки <bug-findutils at gnu.org>.

source: warning: Unix filenames usually don't contain slashes (though pathnames do). That means that '%s %s' will probably evaluate to false all the time on this system. You might find the '-wholename' test more useful, or perhaps '-samefile'. Alternatively, if you are using GNU grep, you could use 'find ... -print0 | grep -FzZ %s'.
ru: предупреждение: имена файлов, в отличие от полных путей, не содержат слэшей. Это значит, что значение вычисления предиката '%s %s' всегда будет равно false. Возможно, вы найдёте предикаты '-wholename' и '-samefile' более полезными для обработки полных путей. В качестве альтернативы можно попробовать и 'find ... -print0 | grep -FzZ %s'.

source: The %s test needs an argument
ru: Тест %s требует аргумент

source: invalid mode %s
ru: неверный режим %s

source: warning: you have specified a mode pattern %s (which is equivalent to /000). The meaning of -perm /000 has now been changed to be consistent with -perm -000; that is, while it used to match no files, it now matches all files.
ru: предупреждение: указанный вами шаблон режима %s эквивалентен /000. Значение -perm /000 недавно изменилось и теперь согласовано со значением -perm -000; таким образом, раньше этому шаблону не соответствовал ни один файл, а теперь ему соответствуют все файлы.

source: invalid null argument to -size
ru: отсутствует аргумент у -size

source: invalid -size type `%c'
ru: неверный тип '%c' для -size

source: Invalid argument `%s%c' to -size
ru: неверный аргумент `%s%c' у -size

source: Invalid argument %s to -used
ru: неверный аргумент %s у -used

source: %s is not the name of a known user
ru: %s не является именем существующего пользователя

source: The argument to -user should not be empty
ru: У -user должен быть непустой аргумент

source: Features enabled:
ru: Дополнительные возможности:

source: Arguments to -type should contain only one letter
ru: Аргумент у -type должен состоять из одного символа

source: Unknown argument to -type: %c
ru: Неизвестный аргумент у -type: %c

source: warning: unrecognized escape `\%c'
ru: предупреждение: нераспознаваемая последовательность '\%c'

source: error: %s at end of format string
ru: error: недопустимый символ %s в конце форматной строки

source: warning: unrecognized format directive `%%%c'
ru: предyпреждение: нераспознаваемый формат директивы '%%%c'

source: The current directory is included in the PATH environment variable, which is insecure in combination with the %s action of find. Please remove the current directory from your $PATH (that is, remove "." or leading or trailing colons)
ru: Значение переменной среды PATH содержит текущий каталог, что небезопасно в сочетании с действием %s утилиты find. Текущий каталог следует удалить из $PATH (т.е. удалить "." и/или двоеточия в начале и/или конце строки)

source: The relative path %s is included in the PATH environment variable, which is insecure in combination with the %s action of find. Please remove that entry from $PATH
ru: Значение переменной среды PATH содержит относительный путь %s, что небезопасно в сочетании с действием %s утилиты find. Этот относительный путь следует удалить из $PATH (т.е. удалить "." и/или двоеточия в начале и/или конце строки)

source: You may not use {} within the utility name for -execdir and -okdir, because this is a potential security problem.
ru: Использование {} недопустимо в имени программы в сочетании с действиями -execdir и -okdir утилиты find, поскольку это небезопасно.

source: Only one instance of {} is supported with -exec%s ... +
ru: Строка {} может быть указана не более одного раза при использовании -exec%s ... +

source: The environment is too large for exec().
ru: Окружение слишком велико для exec().

source: cannot fork
ru: не могу создать процесс

source: error waiting for %s
ru: ошибка ожидания %s

source: %s terminated by signal %d
ru: %s прерван сигналом номер %d

source: invalid expression
ru: неверное выражение

source: invalid expression; you have used a binary operator '%s' with nothing before it.
ru: неверное выражение; попытка использовать бинарный оператор '%s' с одним аргументом.

source: expected an expression between '%s' and ')'
ru: между '%s' и ')' ожидалось выражение

source: expected an expression after '%s'
ru: после '%s' ожидалось выражение

source: invalid expression; you have too many ')'
ru: неверное выражение; слишком много символов ')'

source: invalid expression; expected to find a ')' but didn't see one. Perhaps you need an extra predicate after '%s'
ru: неверное выражение; не хватает символа ')'. Возможно, что после '%s' требуется дополнительный предикат

source: invalid expression; I was expecting to find a ')' somewhere but did not see one.
ru: неверное выражение; не хватает символа ')'

source: oops -- invalid expression type!
ru: оопс -- неверный тип выражения!

source: oops -- invalid expression type (%d)!
ru: оопс -- неверный тип выражения (%d)!

source: paths must precede expression: %s
ru: пути должны быть указаны перед выражением: %s

source: unknown predicate `%s'
ru: неизвестный предикат `%s'

source: invalid predicate `%s'
ru: неверный предикат `%s'

source: invalid argument `%s' to `%s'
ru: неверный аргумент `%s' у `%s'

source: missing argument to `%s'
ru: отсутствует аргумент у `%s'

source: you have too many ')'
ru: слишком много символов ')'

source: unexpected extra predicate '%s'
ru: непредвиденный лишний предикат '%s'

source: unexpected extra predicate
ru: непредвиденный лишний предикат

source: oops -- invalid default insertion of and!
ru: оопс -- неверная вставка по умолчанию оператора 'И' (and)

source: Usage: %s [-H] [-L] [-P] [-Olevel] [-D
ru: Использование: %s [-H] [-L] [-P] [-Olevel] [-D

source: ] [path...] [expression]
ru: ] [путь...] [выражение]

source: The environment variable FIND_BLOCK_SIZE is not supported, the only thing that affects the block size is the POSIXLY_CORRECT environment variable
ru: Переменная среды FIND_BLOCK_SIZE не поддерживается, единственным фактором, влияющим на размер блока, является переменная среды POSIXLY_CORRECT

source: argument list too long
ru: список аргументов слишком велик

source: Built using GNU gnulib version %s
ru: Собрано с GNU gnulib версии %s

source: Usage: %s [--version | --help] or %s most_common_bigrams < file-list > locate-database
ru: Использование: %s [--version | --help] или %s most_common_bigrams < список > закодированный_список

source: Report bugs to <bug-findutils@gnu.org>.
ru: Сообщайте об ошибках по адресу списка рассылки <bug-findutils at gnu.org>.

source: Invalid escape sequence %s in input delimiter specification.
ru: Неправильная управляющая последовательность %s в описании разделителя входного потока.

source: Invalid escape sequence %s in input delimiter specification; character values must not exceed %lx.
ru: Неправильная управляющая последовательность %s в описании разделителя входного потока; значение не должно превышать %lx.

source: Invalid escape sequence %s in input delimiter specification; character values must not exceed %lo.
ru: Неправильная управляющая последовательность %s в описании разделителя входного потока; значение не должно превышать %lo.

source: Invalid escape sequence %s in input delimiter specification; trailing characters %s not recognised.
ru: Неправильная управляющая последовательность %s в описании разделителя входного потока; завершающие символы %s не распознаны.

source: Invalid input delimiter specification %s: the delimiter must be either a single character or an escape sequence starting with \.
ru: Неправильное описание разделителя входного потока %s: разделителем может быть либо одиночный символ, либо управляющая последовательность, начинающаяся с \.

source: environment is too large for exec
ru: окружение слишком велико для исполнения

source: Warning: value %ld for -s option is too large, using %ld instead
ru: Предупреждение: значение %ld слишком велико для параметра -s, вместо него используется значение %ld

source: Cannot open input file %s
ru: Не удалось открыть на чтение файл %s

source: Your environment variables take up %lu bytes
ru: Переменные окружения занимают %lu байт

source: POSIX upper limit on argument length (this system): %lu
ru: верхняя и нижняя границы на длину аргумента согласно POSIX (в этой ОС): %lu

source: POSIX smallest allowable upper limit on argument length (all systems): %lu
ru: верхняя и нижняя границы на длину аргумента согласно POSIX (во всех ОС): %lu

source: Maximum length of command we could actually use: %ld
ru: Максимальная длина комманды, которую можно использовать: %ld

source: Size of command buffer we are actually using: %lu
ru: Размер используемого буфера для комманды: %lu

source: unmatched %s quote; by default quotes are special to xargs unless you use the -0 option
ru: Несбалансированная %s кавычка; кавычки можно использовать только совместно с ключём -0

source: double
ru: двойная

source: single
ru: одинарная

source: argument line too long
ru: строка аргументов слишком велика

source: error waiting for child process
ru: ошибка ожидания дочернего процесса

source: Warning: Lost track of %d child processes
ru: Предупреждение: потерян след %d дочерних процессов

source: %s: exited with status 255; aborting
ru: %s: завершен со статусом 255; прерываюсь

source: %s: stopped by signal %d
ru: %s: остановлен сигналом номер %d

source: %s: terminated by signal %d
ru: %s: завершен сигналом номер %d

source: %s: invalid number for -%c option
ru: %s: неверное число для ключа -%c

source: %s: value for -%c option should be >= %ld
ru: %s: значение для ключа -%c должно быть >= %ld

source: %s: value for -%c option should be < %ld
ru: %s: значение для ключа -%c должно быть < %ld

source: Usage: %s [-0prtx] [--interactive] [--null] [-d|--delimiter=delim] [-E eof-str] [-e[eof-str]] [--eof[=eof-str]] [-L max-lines] [-l[max-lines]] [--max-lines[=max-lines]] [-I replace-str] [-i[replace-str]] [--replace[=replace-str]] [-n max-args] [--max-args=max-args] [-s max-chars] [--max-chars=max-chars] [-P max-procs] [--max-procs=max-procs] [--show-limits] [--verbose] [--exit] [--no-run-if-empty] [--arg-file=file] [--version] [--help] [command [initial-arguments]]
ru: Использование: %s [-0prtx] [--interactive] [--null] [-d|--delimiter=delim] [-E eof-str] [-e[eof-str]] [--eof[=eof-str]] [-L max-lines] [-l[max-lines]] [--max-lines[=max-lines]] [-I replace-str] [-i[replace-str]] [--replace[=replace-str]] [-n max-args] [--max-args=max-args] [-s max-chars] [--max-chars=max-chars] [-P max-procs] [--max-procs=max-procs] [--show-limits] [--verbose] [--exit] [--no-run-if-empty] [--arg-file=file] [--version] [--help] [команда [начальные-аргументы]]
